// // Задача 34: 
// 1. Задайте массив заполненный случайными положительными трёхзначными числами. 
// 2. Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2


Console.Write("Задайте размер массива. Введите число: ");
int numMass = Convert.ToInt32(Console.ReadLine());
int[] numbers = new int[numMass];

void FillArray(int[] array, int min, int max)
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(min, max);
    }
}

void WriteArray(int[] array)
{
    Console.Write("[ ");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.Write("]");
}

int CountEvenNumber(int[] array)
{
    int countEven = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            countEven++;
        }
    }
    return countEven;
}

FillArray(numbers, 100, 999);
WriteArray(numbers);

int countEven = CountEvenNumber(numbers);
Console.WriteLine($" --> Количество чётных чисел в массиве равно: {countEven}.");